In [2]:
import pandas as pd

data = pd.read_csv("sample_submission.csv")
data

         id  target
0         0       0
1         2       0
2         3       0
3         9       0
4        11       0
...     ...     ...
3258  10861       0
3259  10865       0
3260  10868       0
3261  10874       0
3262  10875       0

[3263 rows x 2 columns]

In [8]:
import pymysql

try:
    # Connect to the database
    con = pymysql.connect(host='localhost',
                             user='root',
                             password='1234',
                             db='busan')
    cursor=con.cursor()
    # Create a new record
    sql = "INSERT INTO `submission` (`ids`, `target`) VALUES (%s, %s)"
    cursor.execute(sql, (100000,'0'))
    # connection is not autocommit by default. So we must commit to save our changes.
    con.commit()
    # Execute query
    sql = "SELECT * FROM `submission`"
    cursor.execute(sql)
    # Fetch all the records
    result = cursor.fetchall()
    for i in result:
        print(i)
except Error as e:
    print(e)
finally:
    # close the database connection using close() method.
    con.close()

(1, 100000, '0', datetime.datetime(2021, 4, 23, 16, 33, 52))

In [32]:
# from sqlalchemy import create_engine
# import pandas as pd

# # create sqlalchemy engine
# engine = create_engine("mysql+pymysql://root:1234@localhost/busan"
#                        .format(user="root",
#                                pw="1234",
#                                db="busan"))

# data = pd.read_csv("sample_submission.csv")

# data.to_sql(name = 'submission', con=engine, if_exists = 'append', chunksize=1000)

In [16]:
import pandas as pd

# Create dataframe
data=pd.DataFrame({
    'book_id':[12345,12346,12347],
    'title':['Python Programming','Learn MySQL','Data Science Cookbook'],
    'price':[29,23,27]
})

In [17]:
data

   book_id                  title  price
0    12345     Python Programming     29
1    12346            Learn MySQL     23
2    12347  Data Science Cookbook     27

In [31]:
# from sqlalchemy import create_engine
# pymysql.install_as_MySQLdb()
# import MySQLdb

# # create sqlalchemy engine
# engine = create_engine("mysql+mysqldb://root:"+"1234"+"@localhost:3306/busan", encoding='utf-8')
# engine.connect()

# data.to_sql(name='test', con=engine, if_exists = 'append')

In [30]:
# mysql에 austin_weather테이블 생성 및 데이터 입력
data = pd.read_csv("austin_weather.csv")
engine = create_engine("mysql+mysqldb://root:"+"1234"+"@localhost:3306/busan", encoding='utf-8')
engine.connect()

data.to_sql(name='austin_weather', con=engine, if_exists = 'append')